<template>
  <div class="about">
    <h2>Задача</h2>
    <p>
      Создать страницу, на которой можно будет просматривать персонажей из Рика
      и Морти с помощью открытого API.
    </p>
    <h2>Формальные требования к выполнению задачи</h2>
    <ul>
      <li>Использовать Vue 3 или Vue 2, composition API.</li>
      <li>
        Персонажи выводить в виде карточек, как в источнике. Ссылки на карточке
        заменить на обычный текст.
      </li>
      <li>Реализовать пагинацию с помощью API.</li>
      <li>
        Реализовать фильтрацию по полям "name" и "status" с помощью API.
        Фильтрация должна применяться по нажатию на кнопку "Применить".
      </li>
      <li>
        Для элементов пагинации и фильтрации можно использовать обычные
        HTML-теги (input, select) без стилизации.
      </li>
      <li>Код разместить в репозитории GitHub.</li>
      <li>
        Готовое приложение разместить на GitHub Pages или аналогичном сервисе.
      </li>
    </ul>

    <h2>Источник данных</h2>
    <ul>
      <li>Сайт https://rickandmortyapi.com/.</li>
      <li>Документация размещена на сайте.</li>
    </ul>
  </div>
</template>

